Updated ReadMe.md and minor bug fixed
